[{ "model": "testimonials.testimonialstranslation", "pk": 1, "fields": { "language_code": "en", "description": "I worked with Javier at CityRealty for over 3 years. I’ve found him to be adaptable, supportive, and a great team member. He’s an excellent problem solver and was always a go - to resource for technical issues. He was someone I always trusted and could count on for guidance. He’s a motivated, intelligent , and a forward thinker. It was true pleasure working with him.", "title": "Program Manager - Google", "master": 1 } }, { "model": "testimonials.testimonialstranslation", "pk": 2, "fields": { "language_code": "fr", "description": "J'ai travaillé avec Javier chez CityRealty pendant plus de 3 ans. Je l'ai trouvé adaptable, d'un grand soutien et un excellent membre de l'équipe. C'est un excellent résolveur de problèmes et c'était toujours une personne à contacter pour les questions techniques. C'est une personne en qui j'ai toujours eu confiance et sur laquelle je pouvais compter pour obtenir des conseils. C'est un homme motivé, intelligent et avant-gardiste. Ce fut un réel plaisir de travailler avec lui.", "title": "Responsable de programme - Google", "master": 1 } }, { "model": "testimonials.testimonialstranslation", "pk": 3, "fields": { "language_code": "es", "description": "Trabajé con Javier en CityRealty durante más de 3 años. Lo he encontrado adaptable, solidario y un gran miembro del equipo. Es un excelente solucionador de problemas y siempre fue un recurso de referencia para problemas técnicos. Era alguien en quien siempre confié y con quien podía contar para recibir orientación. Es un pensador motivado, inteligente y progresista. Fue un verdadero placer trabajar con el", "title": "Director de programa - Google", "master": 1 } }, { "model": "testimonials.testimonialstranslation", "pk": 4, "fields": { "language_code": "es", "description": "Aunque no trabajé mucho con Javier, me dejó una impresión muy positiva. No solo analizó los datos, que yo necesitaba para los informes y las historias, sino que siempre habló sobre los hallazgos para asegurarse de que los comprendiera completamente y capturara la información de la manera más precisa. Javier también ayudaría con la lluvia de ideas y era un jugador de equipo completo. Recomiendo a Javier y creo que sería un gran activo para cualquier empresa.", "title": "Vicepresidente de Estrategia en JConnelly", "master": 2 } }, { "model": "testimonials.testimonialstranslation", "pk": 5, "fields": { "language_code": "en", "description": "Though I didn't work with Javier for very long, he left a very positive impression on me. He not only ran the data, which I needed for reports and stories, he always talked through the findings to make sure I fully understood and was capturing the information in the most accurate light. Javier would also assist with brainstorming and was an all-around team player. I recommend Javier and believe that he would be a great asset to any company.", "title": "Vice President, Strategy - JConnelly", "master": 2 } }, { "model": "testimonials.testimonialstranslation", "pk": 6, "fields": { "language_code": "fr", "description": "Même si je n'ai pas travaillé très longtemps avec Javier, il m'a laissé une impression très positive. Il n'a pas seulement géré les données dont j'avais besoin pour les rapports et les histoires, il a toujours parlé des résultats pour s'assurer que je comprenais parfaitement et que je capturais les informations sous la lumière la plus précise. Javier aidait également au brainstorming et était un joueur d'équipe polyvalent. Je recommande Javier et je pense qu'il serait un atout majeur pour toute entreprise.", "title": "Vice-président, Stratégie - JConnelly", "master": 2 } }, { "model": "testimonials.testimonialstranslation", "pk": 7, "fields": { "language_code": "en", "description": "Javier is a close friend and a bastion of data and computer knowledge that I've had the pleasure of working with (and from) for six years at CityRealty. We have collaborated on several projects inside and outside of the office, and his passion for his field that continuously leads him to investigate more efficient and smarter means of solving problems made him a central asset to our team. His expertise in data analysis and various computer languages made him an essential asset to our company and team. I am certain he will bring his intelligence, insight, and professionalism to all his endeavors. – Ondel Hylton, Senior Content Director, CityRealty", "title": "Senior Content Director - CityRealty", "master": 3 } }, { "model": "testimonials.testimonialstranslation", "pk": 8, "fields": { "language_code": "en", "description": "I had the privilege of managing Javier as a CUNY intern for the NYC Department of Education. Javier is extremely hardworking and eager to learn new technologies. He is a great asset to any organization.", "title": "Director of Security Engagement - Sungard", "master": 4 } }, { "model": "testimonials.testimonialstranslation", "pk": 9, "fields": { "language_code": "fr", "description": "J'ai eu le privilège de diriger Javier en tant que stagiaire CUNY pour le département de l'éducation de NYC. Javier est extrêmement travailleur et désireux d'apprendre de nouvelles technologies. Il est un grand atout pour toute organisation.", "title": "Directeur de l'engagement de Sécurité - Sungard", "master": 4 } }, { "model": "testimonials.testimonialstranslation", "pk": 10, "fields": { "language_code": "es", "description": "Tuve el privilegio de administrar a Javier como pasante de CUNY para el Departamento de Educación de la Ciudad de Nueva York. Javier es extremadamente trabajador y con muchas ganas de aprender nuevas tecnologías. Es un gran activo para cualquier organización.", "title": "Director de Compromiso de Seguridad - Sungard", "master": 4 } }, { "model": "testimonials.testimonialstranslation", "pk": 11, "fields": { "language_code": "es", "description": "Javier es un amigo cercano y un bastión de datos y conocimiento informático con el que he tenido el placer de trabajar (y desde) durante seis años en CityRealty. Hemos colaborado en varios proyectos dentro y fuera de la oficina, y su pasión por su campo que lo lleva continuamente a investigar medios más eficientes e inteligentes para resolver problemas lo convirtió en un activo central para nuestro equipo. Su experiencia en análisis de datos y varios lenguajes informáticos lo convirtieron en un activo esencial para nuestra empresa y nuestro equipo. Estoy seguro de que aportará su inteligencia, perspicacia y profesionalismo a todos sus esfuerzos. – Ondel Hylton, director sénior de contenido, CityRealty", "title": "Director sénior de contenido - CityRealty", "master": 3 } }, { "model": "testimonials.testimonialstranslation", "pk": 12, "fields": { "language_code": "fr", "description": "Javier est un ami proche et un bastion de données et de connaissances informatiques avec qui j'ai eu le plaisir de travailler (et depuis) ​​pendant six ans chez CityRealty. Nous avons collaboré à plusieurs projets à l'intérieur et à l'extérieur du bureau, et sa passion pour son domaine qui l'amène continuellement à rechercher des moyens plus efficaces et plus intelligents de résoudre les problèmes a fait de lui un atout central pour notre équipe. Son expertise en analyse de données et en divers langages informatiques fait de lui un atout essentiel pour notre entreprise et notre équipe. Je suis certain qu'il apportera son intelligence, sa perspicacité et son professionnalisme dans toutes ses entreprises. – Ondel Hylton, directeur principal du contenu, CityRealty", "title": "Senior Content Director - CityRealty", "master": 3 } }, { "model": "testimonials.testimonialstranslation", "pk": 13, "fields": { "language_code": "en", "description": "Javier was a student in the Data Analytics course at General Assembly for which I was an instructor. Over 11 weeks I was exposed to his excellent analytical skills, especially with respect to VBA, Advanced Excel development and SQL. His curiosity, creativity and aptitude stood out throughout the course--for example, after an early assignment on basic address normalization he created a VBA module to automate and extend the work we had done, refining it over the course of the class. Javier is also a very amiable, personable guy, which is certainly not a given in this field! I wouldn't hesitate to recommend him to any analytically-minded team.", "title": "Vice President of Data - Audience Town", "master": 5 } }, { "model": "testimonials.testimonialstranslation", "pk": 14, "fields": { "language_code": "es", "description": "Javier era alumno del curso de Análisis de Datos en General Assembly del cual yo era instructor. Durante 11 semanas estuve expuesto a sus excelentes habilidades analíticas, especialmente con respecto a VBA, desarrollo avanzado de Excel y SQL. Su curiosidad, creatividad y aptitud se destacaron a lo largo del curso; por ejemplo, después de una tarea inicial sobre la normalización básica de direcciones, creó un módulo de VBA para automatizar y ampliar el trabajo que habíamos hecho, perfeccionándolo a lo largo de la clase. Javier también es un tipo muy amable y agradable, ¡lo cual ciertamente no es un hecho en este campo! No dudaría en recomendarlo a cualquier equipo con mentalidad analítica.", "title": "Vicepresidente de Datos - Audience Town", "master": 5 } }, { "model": "testimonials.testimonialstranslation", "pk": 15, "fields": { "language_code": "fr", "description": "Javier était étudiant dans le cours d'analyse de données à l'Assemblée générale pour lequel j'étais instructeur. Pendant 11 semaines, j'ai été exposé à ses excellentes compétences analytiques, notamment en ce qui concerne VBA, le développement Excel avancé et SQL. Sa curiosité, sa créativité et ses aptitudes se sont démarquées tout au long du cours - par exemple, après un premier devoir sur la normalisation d'adresses de base, il a créé un module VBA pour automatiser et étendre le travail que nous avions effectué, en l'affinant au cours du cours. Javier est aussi un gars très aimable et sympathique, ce qui n'est certainement pas une évidence dans ce domaine ! Je n'hésiterais pas à le recommander à toute équipe analytique.", "title": "Vice-président des données - Audience Town", "master": 5 } }, { "model": "testimonials.testimonialstranslation", "pk": 16, "fields": { "language_code": "en", "description": "I worked with Javier while he was with the Security Identity desk at the NYC Department of Education. Javier is a hardworking and dedicated individual who was a pleasure to interact with every day - he always followed through on issue resolutions and collaborated on process improvements. I am pleased to recommend Javier to any future prospective employer.", "title": "Director, Service Desk Operations - NYC DOE", "master": 6 } }, { "model": "testimonials.testimonialstranslation", "pk": 17, "fields": { "language_code": "en", "description": "I have had the pleasure of working for many years with Javier. He is a responsible, bright, articulate and energetic person who can view issues from a global perspective. His analytic skills are an asset to any organization.", "title": "Board President - Yonkers Public Schools", "master": 7 } }, { "model": "testimonials.testimonialstranslation", "pk": 18, "fields": { "language_code": "fr", "description": "J'ai eu le plaisir de travailler pendant de nombreuses années avec Javier. C'est une personne responsable, brillante, éloquente et énergique, capable d'envisager les problèmes dans une perspective globale. Ses compétences analytiques sont un atout pour toute organisation.", "title": "Président de la commission scolaire - Yonkers Public Schools", "master": 7 } }, { "model": "testimonials.testimonialstranslation", "pk": 19, "fields": { "language_code": "es", "description": "He tenido el placer de trabajar durante muchos años con Javier. Es una persona responsable, brillante, elocuente y enérgica que puede ver los problemas desde una perspectiva global. Sus habilidades analíticas son un activo para cualquier organización.", "title": "Presidente de la Junta de Escuelas - Públicas de Yonkers", "master": 7 } }, { "model": "testimonials.testimonialstranslation", "pk": 20, "fields": { "language_code": "es", "description": "Trabajé con Javier mientras él estaba en el escritorio de Identidad de Seguridad en el Departamento de Educación de la Ciudad de Nueva York. Javier es una persona trabajadora y dedicada con la que fue un placer interactuar todos los días: siempre cumplió con las resoluciones de problemas y colaboró ​​en las mejoras de procesos. Me complace recomendar a Javier a cualquier futuro empleador.", "title": "Director, Operaciones de la Mesa de Servicio - NYC DOE", "master": 6 } }, { "model": "testimonials.testimonialstranslation", "pk": 21, "fields": { "language_code": "fr", "description": "J'ai travaillé avec Javier lorsqu'il était au bureau de l'identité de sécurité du département de l'éducation de New York. Javier est un travailleur acharné et dévoué avec qui c'était un plaisir d'interagir tous les jours - il a toujours résolu les problèmes et collaboré à l'amélioration des processus. Je suis heureux de recommander Javier à tout futur employeur potentiel.", "title": "Directeur, Service Desk Operations - NYC DOE", "master": 6 } }, { "model": "testimonials.testimonials", "pk": 1, "fields": { "name": "Michelle McFarlane", "img": "media/testimonials/michelle_qhfdg8", "created_on": "2022-07-21T20:38:38.861Z", "updated_on": "2022-07-21T20:43:24.237Z", "active": true } }, { "model": "testimonials.testimonials", "pk": 2, "fields": { "name": "Bonnie Clark", "img": "media/testimonials/bonnie_rrfdqi", "created_on": "2022-07-21T20:38:38.861Z", "updated_on": "2022-07-21T20:43:30.051Z", "active": true } }, { "model": "testimonials.testimonials", "pk": 3, "fields": { "name": "Ondel Hylton", "img": "media/testimonials/ondel_kqzzlf", "created_on": "2022-07-21T20:38:38.861Z", "updated_on": "2022-07-21T20:46:21.691Z", "active": true } }, { "model": "testimonials.testimonials", "pk": 4, "fields": { "name": "Diana Schnabel", "img": "media/testimonials/diana_qyt4gq", "created_on": "2022-07-21T20:38:38.861Z", "updated_on": "2022-07-21T20:43:35.892Z", "active": false } }, { "model": "testimonials.testimonials", "pk": 5, "fields": { "name": "James Be", "img": "media/testimonials/james_wdv5ci", "created_on": "2022-07-21T20:38:38.861Z", "updated_on": "2022-07-21T20:43:42.034Z", "active": true } }, { "model": "testimonials.testimonials", "pk": 6, "fields": { "name": "Jerry George", "img": "media/testimonials/jerry_simrgd", "created_on": "2022-07-21T20:38:38.861Z", "updated_on": "2022-07-21T20:42:20.097Z", "active": true } }, { "model": "testimonials.testimonials", "pk": 7, "fields": { "name": "Rev. Steve Lopez", "img": "media/testimonials/steve_u8s476", "created_on": "2022-07-21T20:38:38.861Z", "updated_on": "2022-07-21T20:42:13.628Z", "active": true } }]