[{"model": "courses.coursetranslation", "pk": 1, "fields": {"language_code": "en", "title": "Getting Started with AWS Machine Learning", "description": "Machine learning (ML) is one of the fastest growing areas in technology and a highly sought after skillset in today’s job market. The World Economic Forum states the growth of artificial intelligence (AI) could create 58 million net new jobs in the next few years, yet it’s estimated that currently there are 300,000 AI engineers worldwide, but millions are needed. This means there is a unique and immediate opportunity for you to get started with learning the essential ML concepts that are used to build AI applications – no matter what your skill levels are. Learning the foundations of ML now, will help you keep pace with this growth, expand your skills and even help advance your career.", "master": 1}}, {"model": "courses.coursetranslation", "pk": 2, "fields": {"language_code": "en", "title": "Data Visualization with Python", "description": "Visualizing data is used by virtually every discipline these days. It is used for analyzing web traffic to determine peak server load, growth and death rate of populations for biological analysis, analyzing weather patterns over time, stock market trends, and so on. Simply put, Data Visualization brings meaning to numbers that help people understand it. Seeing the data change can draw attention to trends and spikes that may otherwise go unnoticed. Python is an open-source (free) programming language has libraries that can be used to read and make useful graphics to present the data.\r\n\r\nIn this course, you will create an application that reads data from CSV files. You will learn how to visualize the data using various techniques using existing Python libraries.", "master": 2}}, {"model": "courses.coursetranslation", "pk": 3, "fields": {"language_code": "en", "title": "Git for Developers Using Github", "description": "This course will give you a first look at using git to manage your code's version control, as well as offering an introduction to accessing the Github tools you'll need as a beginner. Developers need version control, and git is an industry standard. Github's ability to make a repository easily accessible to a distributed team, as well as its support for agile development, make it a valuable tool for every developer's toolbox.\r\n\r\nBy the end of this project, you will create a Github-hosted repository forked from an open-source project and start a Github repository of your own. You'll learn about forking and cloning projects, creating branches to work on a repository in your development environment, pushing your changes, reverting changes, and keeping commits clean. With this introduction, you'll be one step closer to mastering the tools every developer needs to create a new app, a fork of a favorite tool, or the next big project.", "master": 3}}, {"model": "courses.coursetranslation", "pk": 4, "fields": {"language_code": "en", "title": "Python for Everyone", "description": "Do you spend a lot of time repeating workflows, such as copying data, editing files, and setting up map documents? Did you know that you can use Python to automate data reproduction, data management, map display, and many of your other daily tasks in ArcGIS? This course provides the building blocks you need to use Python. You will create and run scripts using these building blocks, and you can apply them directly inside ArcGIS and to your own workflows.\r\n\r\nExercises can be completed with either ArcGIS Pro or ArcMap.", "master": 4}}, {"model": "courses.coursetranslation", "pk": 5, "fields": {"language_code": "en", "title": "Data Analytics", "description": "Marketing managers who know SQL make 41% more than those who don’t, and GMs earn 29% more with data analysis skills. Hone crucial proficiency in Excel, SQL, and Tableau and make career moves across industries and roles.", "master": 5}}, {"model": "courses.coursetranslation", "pk": 6, "fields": {"language_code": "en", "title": "Use Excel like a Pro. Fast", "description": "This two-hour Excel crash course is the quickest way to go from spreadsheet rookie to rockstar. It's an accelerated 'learn-by-doing' approach: we'll solve a business problem by designing a model, collecting data and building a spreadsheet. Along the way, we'll cover the keyboard shortcuts, functions and insider 'best practices' to make your spreadsheets sizzle!", "master": 6}}, {"model": "courses.coursetranslation", "pk": 7, "fields": {"language_code": "en", "title": "Excel 2013 - Getting Started", "description": "This course covers how to get started with Microsoft Excel 2013. Students will learn how to identify the elements of the Excel interface, create a basic worksheet and learn how to access the help system. This course is taught by Debbie Fierst.", "master": 7}}, {"model": "courses.coursetranslation", "pk": 8, "fields": {"language_code": "en", "title": "Introduction to Relational Database and SQL", "description": "In this guided project, you will get hands-on experience working with a relational database using MySQL Workbench from Oracle. The basic knowledge you learn will allow you to work with any other relational database.\r\n\r\nAt the end of this project, you will be able to create a billing report and a club member roster.", "master": 8}}, {"model": "courses.coursetranslation", "pk": 9, "fields": {"language_code": "en", "title": "Advanced Relational Database and SQL", "description": "In this 1-hour long project-based course, you will gain hands-on experience and learn about advanced SQL topics such as stored procedures, tiggers, functions, common table expressions and recursion. If you have intermediate level of experience with SQL and want to learn more, this course is for you!\r\n\r\nNote: This is an advanced level course. Taking my course \"Introduction to Relational Database and SQL\" and \"Intermediate Relational Database and SQL\" before taking this course is highly recommended. Especially if you do not have any previous experience with relational database and SQL.", "master": 9}}, {"model": "courses.coursetranslation", "pk": 10, "fields": {"language_code": "en", "title": "Security and Privacy for Big Data - Part 2", "description": "This course sensitizes regarding privacy and data protection in Big Data environments. You will discover privacy preserving methodologies, as well as data protection regulations and concepts in your Big Data system. By the end of the course, you will be ready to plan your next Big Data project successfully, ensuring that all privacy and data protection related issues are under control. You will look at decent-sized big data projects with privacy-skilled eyes, being able to recognize dangers. This will allow you to improve your systems to a grown and sustainable level.", "master": 10}}, {"model": "courses.coursetranslation", "pk": 11, "fields": {"language_code": "en", "title": "Security and Privacy for Big Data - Part 1", "description": "This course sensitizes security in Big Data environments. You will discover cryptographic principles, mechanisms to manage access controls in your Big Data system. By the end of the course, you will be ready to plan your next Big Data project successfully, ensuring that all security-related issues are under control.\r\n\r\nYou will look at decent-sized big data projects with security-skilled eyes, being able to recognize dangers. This will allow you to improve your systems to a grown and sustainable level.", "master": 11}}, {"model": "courses.coursetranslation", "pk": 12, "fields": {"language_code": "en", "title": "Troubleshooting and Debugging Techniques", "description": "In this course, we'll give you the tools to quickly identify and solve real-world problems that you might come across in your IT role. We'll look at a bunch of different strategies and approaches for tackling the most common pitfalls of your code and IT infrastructure. You'll learn strategies for approaching almost any technical problem and then see how those apply to solving different real-world scenarios. \r\n\r\nWe picked examples that include general system issues, issues with software that someone else wrote, and issues with programs that we wrote. We'll talk about problems that can affect any operating system, and we'll also look at challenges specific to certain platforms and scripting languages.", "master": 12}}, {"model": "courses.coursetranslation", "pk": 13, "fields": {"language_code": "en", "title": "Javascript: Understanding the Weird Parts", "description": "Javascript is the language that modern developers need to know, and know well. Truly knowing Javascript will get you a job, and enable you to build quality web and server applications.", "master": 13}}, {"model": "courses.coursetranslation", "pk": 14, "fields": {"language_code": "en", "title": "Business Data Analysis with Microsoft Excel and Power BI", "description": "Microsoft Excel is the world's most used and versatile business analysis, reporting and strategy software. Having a deep practical knowledge of Excel will turn you almost superhuman at work and increase your productivity. You will be seen as a very efficient, highly competent and indispensable partner in the organization's progress. And, hopefully, it will lead to a much greater career role and opportunity", "master": 14}}, {"model": "courses.coursetranslation", "pk": 15, "fields": {"language_code": "en", "title": "Introduction to Python Programming", "description": "Let's get started learning one of the most easiest coding languages out there right now. There's no need to fret if you haven't coded before. By the time you finish this course, you'll be a pro at Python!", "master": 15}}, {"model": "courses.coursetranslation", "pk": 16, "fields": {"language_code": "en", "title": "Excel VBA programming by Examples", "description": "Understand what you are going to achieve through the VBA by seeing demo and then see step by step explanation of VBA code. Learn about Excel VBA syntax, Excel VBA form and control, methods of  using forms and controls, several workout examples to see usage of Excel VBA for automation.", "master": 16}}, {"model": "courses.coursetranslation", "pk": 17, "fields": {"language_code": "en", "title": "Python Programming", "description": "In this course you will learn the basics of programming one of the most popular languages nowadays. You will start from the basics, and then cover modules and syntax, to the use of rules to create your first applications. You will incorporate the necessary knowledge of Class-Based-View, login - register - accounts, CRUD and modelforms. You will develop a blog-style web application using Python in Django Framework.", "master": 17}}, {"model": "courses.coursetranslation", "pk": 18, "fields": {"language_code": "es", "title": "Programación Python", "description": "En este curso aprenderás las bases de programación uno de los lenguajes más populares en estos tiempos. Partirás desde sus fundamentos, para luego abarcar módulos y sintaxis, hasta el uso de reglas para crear tus primeras aplicaciones. Incorporarás los conocimientos necesarios de Class-Based-View, login - register - accounts, CRUD y modelforms. Desarrollarás una aplicación web estilo blog de la mano de Python en Django Framework.", "master": 17}}, {"model": "courses.coursetranslation", "pk": 19, "fields": {"language_code": "es", "title": "Programación de Excel VBA por Ejemplos", "description": "Entienda lo que va a lograr a través del VBA viendo la demostración y luego vea la explicación paso a paso del código VBA. Aprenda sobre la sintaxis de Excel VBA, la forma y el control de Excel VBA, los métodos de uso de formas y controles, varios ejemplos de entrenamiento para ver el uso de Excel VBA para la automatización.", "master": 16}}, {"model": "courses.coursetranslation", "pk": 20, "fields": {"language_code": "es", "title": "Introducción a la programación Python.", "description": "Comencemos a aprender uno de los lenguajes de codificación más fáciles que existen en este momento. No hay necesidad de preocuparse si no ha codificado antes. Cuando termine este curso, ¡será un profesional en Python!", "master": 15}}, {"model": "courses.coursetranslation", "pk": 21, "fields": {"language_code": "fr", "title": "Programmation Python", "description": "Dans ce cours, vous apprendrez les bases de la programmation d'un des langages les plus populaires de nos jours. Vous commencerez par les bases, puis vous couvrirez les modules et la syntaxe, jusqu'à l'utilisation de règles pour créer vos premières applications. Vous intégrerez les connaissances nécessaires en matière de Class-Based-View, login - register - accounts, CRUD et modelforms. Vous développerez une application web de type blog en utilisant Python dans le Framework Django.", "master": 17}}, {"model": "courses.coursetranslation", "pk": 22, "fields": {"language_code": "fr", "title": "Introduction à la Programmation Python", "description": "Commençons à apprendre l'un des langages de codage les plus faciles à utiliser actuellement. Vous n'avez pas à vous inquiéter si vous n'avez jamais codé auparavant. À la fin de ce cours, vous serez un pro du Python !", "master": 15}}, {"model": "courses.coursetranslation", "pk": 23, "fields": {"language_code": "fr", "title": "Premiers pas avec AWS et l'apprentissage Automatique", "description": "L'apprentissage automatique (ML) est l'un des domaines technologiques à la croissance la plus rapide et un ensemble de compétences très recherché sur le marché du travail actuel. Le Forum économique mondial affirme que la croissance de l'intelligence artificielle (IA) pourrait créer 58 millions de nouveaux emplois nets au cours des prochaines années. Pourtant, on estime qu'il y a actuellement 300 000 ingénieurs en IA dans le monde, mais qu'il en faudrait des millions. Cela signifie qu'il existe une opportunité unique et immédiate pour vous de commencer à apprendre les concepts essentiels de ML qui sont utilisés pour construire des applications d'IA - quel que soit votre niveau de compétence. En apprenant dès maintenant les bases du ML, vous pourrez suivre le rythme de cette croissance, élargir vos compétences et même faire progresser votre carrière.", "master": 1}}, {"model": "courses.coursetranslation", "pk": 24, "fields": {"language_code": "es", "title": "Primeros pasos con el Aprendizaje Automático de AWS", "description": "El aprendizaje automático (ML) es una de las áreas de más rápido crecimiento en tecnología y un conjunto de habilidades muy buscado en el mercado laboral actual. El Foro Económico Mundial afirma que el crecimiento de la inteligencia artificial (IA) podría crear 58 millones de nuevos empleos netos en los próximos años, sin embargo, se estima que actualmente hay 300 000 ingenieros de IA en todo el mundo, pero se necesitan millones. Esto significa que existe una oportunidad única e inmediata para que comience a aprender los conceptos esenciales de ML que se utilizan para crear aplicaciones de IA, sin importar cuáles sean sus niveles de habilidad. Aprender los fundamentos de ML ahora lo ayudará a seguir el ritmo de este crecimiento, ampliar sus habilidades e incluso ayudarlo a avanzar en su carrera.", "master": 1}}, {"model": "courses.course", "pk": 1, "fields": {"platform": "Coursera", "categories": "devops", "cover": "media/courses/coursera1_thumb_lwy8k7", "updated_on": "2022-07-29T20:52:10.377Z", "created_on": "2022-07-29T01:36:03.999Z", "status": 1, "obtained_date": "2020-09-08T16:00:00Z", "link": "https://coursera.org/share/04df2695560fd01cbd795c7b3e91ccfa"}}, {"model": "courses.course", "pk": 2, "fields": {"platform": "Coursera", "categories": "programming", "cover": "media/courses/coursera2_thumb_tn4d5e", "updated_on": "2022-07-29T18:03:15.258Z", "created_on": "2022-07-29T01:58:07.891Z", "status": 1, "obtained_date": "2020-08-29T16:00:00Z", "link": "https://coursera.org/share/4a073433169273935382641fb3068d93"}}, {"model": "courses.course", "pk": 3, "fields": {"platform": "Coursera", "categories": "github", "cover": "media/courses/coursera3_thumb_jyf8xh", "updated_on": "2022-07-29T18:03:07.902Z", "created_on": "2022-07-29T01:58:47.858Z", "status": 1, "obtained_date": "2020-09-10T14:22:04Z", "link": "https://coursera.org/share/be088dce3d5683f8a6708fcb6c2ac31a"}}, {"model": "courses.course", "pk": 4, "fields": {"platform": "ESRI", "categories": "programming", "cover": "media/courses/esri1_thumb_hsf5rm", "updated_on": "2022-07-29T18:02:59.866Z", "created_on": "2022-07-29T01:59:27.142Z", "status": 1, "obtained_date": "2020-09-05T16:00:00Z", "link": "https://www.esri.com/training/catalog/57630436851d31e02a43f13c/python-for-everyone/"}}, {"model": "courses.course", "pk": 5, "fields": {"platform": "General Assembly", "categories": "excel analysis databases", "cover": "media/courses/ga1_thumb_sj3aqw", "updated_on": "2022-07-29T18:59:55.408Z", "created_on": "2022-07-29T02:00:11.789Z", "status": 1, "obtained_date": "2015-05-20T02:09:16Z", "link": "https://generalassemb.ly/education/data-analytics"}}, {"model": "courses.course", "pk": 6, "fields": {"platform": "Udemy", "categories": "excel", "cover": "media/courses/udemy1_thumb_fwaqz2", "updated_on": "2022-07-29T18:03:55.098Z", "created_on": "2022-07-29T02:00:48.243Z", "status": 1, "obtained_date": "2015-03-01T05:00:00Z", "link": "https://www.udemy.com/share/102ekY3@WjBfmdWfRpte033L0Qi2e0pInsjVjGIGUtfppVNeO3YKUg2B5e4UQUxzYZoE8R0=/"}}, {"model": "courses.course", "pk": 7, "fields": {"platform": "Udemy", "categories": "excel", "cover": "media/courses/udemy2_thumb_fihqsu", "updated_on": "2022-07-29T18:05:04.623Z", "created_on": "2022-07-29T02:01:20.500Z", "status": 1, "obtained_date": "2017-06-29T02:09:16Z", "link": "https://www.udemy.com/share/106Rsg3@xN94zscyuAKkzJOjHsBfrdD4w0P5PrQ-g1zmVe8-SHbSF1fNWxR82Uzpdn629qA=/"}}, {"model": "courses.course", "pk": 8, "fields": {"platform": "Coursera", "categories": "databases", "cover": "media/courses/coursera4_thumb_lvwlgy", "updated_on": "2022-07-29T18:02:22.906Z", "created_on": "2022-07-29T15:05:10.572Z", "status": 1, "obtained_date": "2020-09-15T04:00:00Z", "link": "https://coursera.org/share/af10dfed4733299ebfbf2277e73f1e83"}}, {"model": "courses.course", "pk": 9, "fields": {"platform": "Coursera", "categories": "databases", "cover": "media/courses/coursera5_thumb_jh3ebw", "updated_on": "2022-07-29T18:02:15.523Z", "created_on": "2022-07-29T15:08:38.618Z", "status": 1, "obtained_date": "2020-09-14T04:00:00Z", "link": "https://coursera.org/share/0e41531c3e19e336dc8cc88d00819e3e"}}, {"model": "courses.course", "pk": 10, "fields": {"platform": "Coursera", "categories": "security", "cover": "media/courses/coursera6_thumb_ezutbe", "updated_on": "2022-07-29T18:02:07.107Z", "created_on": "2022-07-29T15:17:14.252Z", "status": 1, "obtained_date": "2020-09-15T04:00:00Z", "link": "https://coursera.org/share/07bb703d64debe5a0c7b290c84eeade4"}}, {"model": "courses.course", "pk": 11, "fields": {"platform": "Coursera", "categories": "security", "cover": "media/courses/coursera7_thumb_qvzart", "updated_on": "2022-07-29T18:01:55.318Z", "created_on": "2022-07-29T15:21:16.805Z", "status": 1, "obtained_date": "2020-09-15T04:00:00Z", "link": "https://www.coursera.org/learn/security-privacy-big-data"}}, {"model": "courses.course", "pk": 12, "fields": {"platform": "Coursera", "categories": "programming", "cover": "media/courses/coursera8_thumb_n1sxxg", "updated_on": "2022-07-29T18:01:43.540Z", "created_on": "2022-07-29T15:27:04.859Z", "status": 1, "obtained_date": "2020-09-14T04:00:00Z", "link": "https://www.coursera.org/learn/troubleshooting-debugging-techniques"}}, {"model": "courses.course", "pk": 13, "fields": {"platform": "Udemy", "categories": "programming", "cover": "media/courses/udemy3_thumb_neexlh", "updated_on": "2022-07-29T18:16:14.389Z", "created_on": "2022-07-29T18:16:14.389Z", "status": 1, "obtained_date": "2019-11-20T05:00:00Z", "link": "https://www.udemy.com/share/101XjU3@GBNbiMN0ZWUk5bKJwfRHyMLPANPg4yCT2e754jIbXNxMy20JGY4Sby4F2i-rdWo=/"}}, {"model": "courses.course", "pk": 14, "fields": {"platform": "Udemy", "categories": "excel", "cover": "media/courses/udemy4_thumb_ds2uh8", "updated_on": "2022-07-29T18:19:43.378Z", "created_on": "2022-07-29T18:19:20.683Z", "status": 1, "obtained_date": "2019-01-21T05:00:00Z", "link": "https://www.udemy.com/share/101EFc3@vnDF7H8Mn4CIDw3AR-anQWX_MXR4t7T76NcexSvdFCjFxJxiMRyjB7U29e5s1-8=/"}}, {"model": "courses.course", "pk": 15, "fields": {"platform": "Udemy", "categories": "excel", "cover": "media/courses/udemy5_thumb_dsayoh", "updated_on": "2022-07-29T20:34:25.454Z", "created_on": "2022-07-29T18:23:19.127Z", "status": 0, "obtained_date": "2019-12-12T05:00:00Z", "link": "https://www.udemy.com/share/101r1i3@MghYQDprsg91KAbFV46qghV_LtUWgiov5eLvvGKpBMjyd4-B4YSCRIFMOAKo2MA=/"}}, {"model": "courses.course", "pk": 16, "fields": {"platform": "Udemy", "categories": "excel programming", "cover": "media/courses/udemy6_thumb_oulhi1", "updated_on": "2022-07-29T20:15:59.306Z", "created_on": "2022-07-29T18:26:44.981Z", "status": 1, "obtained_date": "2018-06-03T04:00:00Z", "link": "https://www.udemy.com/share/101rwm3@chtbFhPbudPW15xZJS1r6ALCTarGFZfDRU5LS0RdOXUT0LBwrbH3AeZ_f0lEsOY=/"}}, {"model": "courses.course", "pk": 17, "fields": {"platform": "CoderHouse", "categories": "programming backend databases", "cover": "media/courses/coderhouse_thumb_utupgv", "updated_on": "2022-07-29T20:32:00.055Z", "created_on": "2022-07-29T19:07:00.171Z", "status": 1, "obtained_date": "2022-06-07T16:00:00Z", "link": "https://us.coderhouse.com/online/python"}}]